#Generated by Fabric Compiler ( version 2021.4-SP1.2 <build 96435> ) at Wed Dec 20 10:56:14 2023

set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
add_design "D:/FPGAProjects/SRC3/IOB_4K_IFC_protocol_git/source/get_signal_edge.v"
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
add_design "D:/FPGAProjects/SRC3/IOB_4K_IFC_protocol_git/source/tb_src3cpld.v"
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module tb_src3cpld
remove_design -verilog "D:/FPGAProjects/SRC3/IOB_4K_IFC_protocol_git/source/tb_src3cpld.v"
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
add_design "D:/FPGAProjects/SRC3/IOB_4K_IFC_protocol_git/source/delay_cy.v"
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
add_design "D:/FPGAProjects/SRC3/IOB_4K_IFC_protocol_git/source/circular_buffer.v"
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
add_design "D:/FPGAProjects/SRC3/IOB_4K_IFC_protocol_git/source/tb_delay_cy.v"
remove_design -verilog "D:/FPGAProjects/SRC3/IOB_4K_IFC_protocol_git/source/tb_delay_cy.v"
add_simulation "D:/FPGAProjects/SRC3/IOB_4K_IFC_protocol_git/source/tb_delay_cy.v"
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
remove_simulation "D:/FPGAProjects/SRC3/IOB_4K_IFC_protocol_git/source/tb_delay_cy.v"
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
add_design "D:/FPGAProjects/SRC3/IOB_4K_IFC_protocol_git/source/ifc_checksum.v"
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
add_design "D:/FPGAProjects/SRC3/IOB_4K_IFC_protocol_git/source/ifc_parse.v"
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
add_design "D:/FPGAProjects/SRC3/IOB_4K_IFC_protocol_git/source/sample_timer.v"
add_simulation "D:/FPGAProjects/SRC3/IOB_4K_IFC_protocol_git/source/tb_sample_timer.v"
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
remove_design -verilog "D:/FPGAProjects/SRC3/IOB_4K_IFC_protocol_git/source/ifc_parse.v"
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
remove_simulation "D:/FPGAProjects/SRC3/IOB_4K_IFC_protocol_git/source/tb_sample_timer.v"
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
add_simulation "D:/FPGAProjects/SRC3/IOB_4K_IFC_protocol_git/source/tb_sample_timer.v"
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
set_arch -family Compact -device PGC4KD -speedgrade -6 -package LPG144
compile -top_module src3cpld
synthesize -dir {imports/pango/PDS_2021.4-SP1.2/syn/bin/synplify_pro.exe} -ads -frequency {100} -top_module {src3cpld} -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {28141} 
